emacs.org
#+TITLE: emacs.org
#+AUTHOR: Andre Pascal Beyer
#+EMAIL: beyeran@gmail.com

* Globals, Functions and Settings
** Globals
#+begin_src emacs-lisp :tangle emacs.el
  (require 'eldoc)

  (prefer-coding-system 'utf-8)

  (setq user-mail-address "beyeran@gmail.com")
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq inhibit-startup-echo-area-message t)
  (setq inhibit-startup-message t)

  (defmacro with-module (symbol name-string &rest body)
    `(condition-case nil
         (progn
           (add-to-load-path  ,(format "%s%s" *modules-dir* name-string))
           (autoload ',symbol ,name-string ,name-string t)
           ,@body)
   
       (error (message (format " => problem loading %s" ',symbol))
              nil)))

  (defmacro with-library (symbol &rest body)
    `(condition-case nil
         (progn
           (add-to-load-path ,(format "%s%s" *modules-dir* symbol))
           (require ',symbol)
           ,@body)))

  (defun require-special-theme (symbol variant)
    (condition-case nil
        (progn
          (add-to-load-path (format "~/.emacs.d/color-theme/%s" symbol))
          (require (intern (format "%s-theme" symbol)))
          (load-theme (intern (format "%s-%s" symbol variant)) t))
    
      (error (message (format " => problem loading %s" symbol))
              nil)))

  (defun add-to-load-path (path)
    "Wrapps the ADD-TO-LIST function for the LOAD-PATH variable"
    (add-to-list 'load-path path))

  (defun add-theme (path)
    "Wrapps the ADD-TO-LIST function for the CUSTOM-THEME-LOAD-PATH variable"
    (add-to-list 'custom-theme-load-path (format "~/.emacs.d/color-theme/%s"
                             path)))

  (defun add-to-alist (suffix-mode-list)
    "Wrapps the ADD-TO-LIST function for the AUTO-MODE-ALIST variable"
    (add-to-list 'auto-mode-alist suffix-mode-list))

  ;; remember tangle files before!
  (mapc #'load (directory-files "~/.emacs.d/src/" t "\\.el$"))

  (add-to-load-path "~/.emacs.d/src/")
#+end_src
** Settings
#+begin_src emacs-lisp :tangle src/settings.el
  (put 'with-module 'lisp-indent-function 1)

  (defun pretty-lambdas ()
    (font-lock-add-keywords
     nil `(("(\\(lambda\\>\\)"
            (0 (progn (compose-region (match-beginning 1) (match-end 1)
                                      ,(make-char 'greek-iso8859-7 107))
                      nil))))))

  (font-lock-add-keywords 'emacs-lisp-mode
                          '(("(\\(lambda\\)\\>" (0 (prog1 ()
                                                (compose-region (match-beginning 1)
                                                                (match-end 1)
                                                                λ))))))

  (font-lock-add-keywords 'python
                          '(("lambda" (0 (prog1 ()
                                           (compose-region (match-beginning 1)
                                                           (match-end 1)
                                                           λ))))))

  ;; (add-hook 'lisp-mode-hook (prettify-symbols-mode))
  ;; (add-hook 'emacs-lisp-mode-hook (prettify-symbols-mode))

  (case system-type
    (windows-nt
     (setenv "CYGWIN" (concat (getenv "CYGWIN") " nodosfilewarning"))
     (mapc (apply-partially 'add-to-list 'exec-path)
           `("C:/Perl/bin"
             "C:/cygwin/bin"))
     (setenv "PATH"
             (mapconcat 'identity
                        `(
                          "C:/cygwin/bin"
                          "C:/MinGW/bin"
                          ,(getenv "PATH"))
                        ";")))
    (gnu/linux
     (setenv "LC_MESSAGES" "C")
     (setenv "MANWIDTH" "72")))
#+end_src
* Programming
** ESS
#+BEGIN_SRC emacs-lisp :tangle src/ess.el
  ;; ESS mode

  (load "~/.emacs.d/modules/ess-site/lisp/ess-site")
  (setq inferior-julia-program-name "c:/Program Files/Julia/bin/julia.exe")
#+END_SRC
** web development
#+begin_src emacs-lisp :tangle src/modules.el
  (with-library js2-mode)
  (with-library simple-httpd)
  (with-library skewer-mode
                (add-hook 'js2-mode-hook 'skewer-mode))

  (add-to-alist '("\\.\\(js\\|json\\)$" . js2-mode))

  (define-key js2-mode-map (kbd "\C-c\C-r") 'skewer-eval-region)
  (define-key js2-mode-map (kbd "\C-c\C-e") 'skewer-eval-last-expression)

  (with-library skewer-repl)
  (with-library skewer-bower)

  (defun skewer-eval-region (start end)
    "Evaluate the region as JavaScript code."
    (interactive "r")
    (skewer-eval (buffer-substring-no-properties start end)
                 #'skewer-post-minibuffer))
#+end_src
** python
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; python
  ;;
  ;; copied from github.com/danlei/emacs
  ;; Thanks Daniel!
  ;;

  (require 'python nil t)
  ;; (setq python-process-kill-without-query t
  ;; python-default-version 3)

  (add-hook 'python-mode-hook
            (lambda ()
                                          ; (local-set-key (kbd "<C-tab>") 'symbol-complete)
              (local-set-key (kbd "C-c d") 'pydoc)
                                          ; (setq parens-require-spaces nil)
              (eldoc-mode 1)))

  (add-hook 'inferior-python-mode-hook
            (lambda ()
              (local-set-key (kbd "C-c d") 'pydoc)))

  (setq dhl-python-command
        (if (eq system-type 'windows-nt)
            "C:/Python34/python.exe"
          "python3"))

  (setq-default python-shell-interpreter dhl-python-command
                python-shell-interpreter-args "-ui"
                                          ; python-command dhl-python-command
                                          ; python-python-command dhl-python-command
                )

  (defadvice python-describe-symbol
    (after dhl-python-describe-symbol-advice last () activate)
    "Switch to the python help buffer after invocation."
    (other-window 1))

  ;; modified from http://ubuntuforums.org/showthread.php?t=1363999
  (defun pydoc (word)
    "Launch pydoc on the word at point"
    (interactive
     (list (let* ((word (thing-at-point 'word))
                  (input (read-string
                          (format "pydoc entry%s: "
                                  (if word
                                      (format " (default %s)" word)
                                    "")))))
             (if (string= input "")
                 (or word (error "No pydoc args given"))
               input))))
    (save-window-excursion
      (shell-command (concat "pydoc " word) "*PYDOC*"))
    (view-buffer "*PYDOC*" 'bury-buffer))

  (define-key python-mode-map (kbd "C-c C-c") 'python-shell-send-defun)
  (define-key python-mode-map (kbd "C-c C-r") 'python-shell-send-region)

  ;;
  ;; projectile
  ;;

  ;; (add-hook 'python-mode-hook 'projectile-mode)
#+end_src
** ruby
 #+begin_src emacs-lisp :tangle src/modules.el
 ;;
 ;; inf-ruby
 ;;

 (with-library inf-ruby
               (define-key ruby-mode-map (kbd "C-c C-c") 'ruby-send-definition)
               (define-key ruby-mode-map (kbd "C-c C-r") 'ruby-send-region)
               (define-key ruby-mode-map (kbd "C-c C-b") 'ruby-send-buffer))
 #+end_src
** perl
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; perl
;;

;; (with-library sepia
;;               (setq sepia-perl5lib (list (expand-file-name "~/.emacs.d/modules/sepia/lib")))
;;               (defalias 'perl-mode 'sepia-mode))

#+end_src
** chicken
#+begin_src emacs-lisp :tangle src/modules.el
(require 'autoinsert)
(add-hook 'find-file-hooks 'auto-insert)

(setq auto-insert-alist
      '(("\\.scm" .
         (insert "#!/usr/bin/csi -s\n\n"))))

(setf scheme-program-name "c:/cygwin/bin/csi.exe -:c")
#+end_src
** haskell
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; haskell mode
  ;;
  ;; (with-library haskell-mode
  ;;               (require 'haskell-mode-autoloads)
  ;;               (add-to-list 'Info-default-directory-list "~/.emacs.d/modules/haskell-mode/")

  ;;               (add-to-alist '("\\.\\(hs\\|lhs\\)$" . haskell-mode))

  ;;               (add-hook 'haskell-mode-hook 'turn-on-haskell-indent))


#+end_src
** lisp
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; lisp
;;
(setq inferior-lisp-program (case system-type
                                  ((windows-nt cygwin) "c:/ccl/wx86cl -K utf-8")))

#+end_src
** picolisp
#+begin_src emacs-lisp :tangle src/modules.el
  (add-to-load-path (concat *modules-dir* "picolisp-mode"))
  (require 'picolisp)

  (add-to-list 'auto-mode-alist '("\\.l$" . picolisp-mode))

  (add-hook 'picolisp-mode-hook
            (lambda ()
              (paredit-mode +1) ;; Loads paredit mode automatically
              (tsm-mode) ;; Enables TSM
              (define-key picolisp-mode-map (kbd "RET") 'newline-and-indent)
              (define-key picolisp-mode-map (kbd "C-h") 'paredit-backward-delete)))
#+end_src
** clojure
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; clojure
  ;;

  (with-library clojure-mode
                (add-to-alist '("\\.\\(clj\\)$" . clojure-mode)))

  ;;
  ;; needed for cider
  ;;
  ;; (with-library epl)
  ;; (with-library dash)
  ;; (with-library pkg-info)

  ;; (with-library cider
  ;;               (add-hook 'cider-mode-hook 'cider-turn-on-eldoc-mode)
  ;;               (setq nrepl-hide-special-buffers t)
  ;;               (setq cider-repl-pop-to-buffer-on-connect nil)
  ;;               (setq cider-repl-results-prefix ";; => "))

#+end_src
** julia
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; julia
  ;;

  ;; (with-library julia-mode)

#+end_src

** APL
#+begin_src emacs-lisp :tangle src/modules.el
;;
;; APL
;;

(add-to-list 'load-path "~/.emacs.d/modules/apl")

(when (require 'gnu-apl-mode nil t)
  (dolist (hook '(gnu-apl-mode-hook gnu-apl-interactive-mode-hook))
    (add-hook hook (lambda ()
                     (eldoc-mode)
                     (setq buffer-face-mode-face 'gnu-apl-default)
                     (buffer-face-mode))))
  (set-face-attribute 'gnu-apl-default nil
                      :family "DejaVu Sans Mono")
  (add-to-list 'auto-mode-alist '("\\.apl$" . gnu-apl-mode)))

(setq gnu-apl-show-keymap-on-startup t)

(add-hook 'gnu-apl-interactive-mode-hook 
          '(lambda ()
             (setq buffer-face-mode 'gnu-apl-default)
             (buffer-face-mode)))

#+end_src
** elm
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; ELM
  ;;

  ;; (with-library elm-mode
  ;;               (cond ((eq system-type 'windows-nt) 
  ;;                      (progn
  ;;                        (let ((path "C:\\Program Files (x86)\\Elm Platform\\0.14.1\\bin"))
  ;;                          (setenv "PATH" (concat (getenv "PATH") (format ";%s" path)))
  ;;                          (setq exec-path (append exec-path '(path))))))))
#+end_src
** erlang
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; erlang
  ;;

  ;; (setq load-path (cons "C:/Program Files/erl/lib/tools-2.7.2/emacs/" load-path))
  ;; (setq erlang-root-dir "C:/Program Files/erl")
  ;; (setq exec-path (cons "C:/Program Files/erl/bin" exec-path))

  ;; (require 'erlang-start)
  ;; (require 'erlang-flymake)
#+end_src
** lfe
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; LFE Mode
  ;;
    
  (with-library lfe-mode)
  (with-library lfe-start)
  (with-library inferior-lfe)
  
  (setq inferior-lfe-program (case system-type
                               ((windows-nt cygwin) "c:/Program Files/erl6.3/bin/erl.exe")))
  
  (setq inferior-lfe-program-options (case system-type
                                      ((windows-nt cygwin) '("-pa c:/cygwin/home/Hans/opt/lfe/ebin -noshell -s lfe_shell start"))))
#+end_src
** Elixir
#+begin_src emacs-lisp :tangle src/modules.el
  ;;
  ;; Elixir Mode
  ;;

  (with-library elixir-mode)

#+end_src

* Org
** General Settings
*** General
#+begin_src emacs-lisp :tangle src/myorg.el
  (add-to-list 'load-path (expand-file-name "~/.emacs.d/modules/org-mode/lisp"))
  (add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\)$" . org-mode))
  
  ;; hide stars:
  (setq org-hide-leading-stars 'hidestars)
  
  ;; "Enter" key follows links
  (setq org-return-follows-link t)
  
  ;; diverse general settings
  (setq org-src-fontify-natively t)
  (setq org-src-tab-acts-natively t)

#+end_src
*** Babel
#+begin_src emacs-lisp :tangle src/myorg.el
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (sh . t)
     (ditaa . t)
     ;; (R . t)
     (ledger . t)
     (perl . t)
     (octave . t)
     (picolisp . t)
     (ruby . t)
     (python . t)
     (js . t)
     (lisp . t)
     (haskell . t)))

  ;; speaciality for R
  (add-to-list 'org-src-lang-modes
               '("r" . ess-mode)
               '("jl" . ess-mode))

  ;; nice bullets
  (with-library org-bullets
                (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

  ;; ledger mode
  ;; (with-library ledger-mode)
#+end_src
** Org Export Templates
